---
kind: property
id: P:Autodesk.Revit.DB.GridNode.VIndex
source: html/d61d520d-12cc-1f87-0733-0e4c49bb54e7.htm
---
# Autodesk.Revit.DB.GridNode.VIndex Property

The node's index along the V axis.

## Syntax (C#)
```csharp
public int VIndex { get; set; }
```